{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "input_dtype": "float32", "trainable": true, "arguments": {}, "batch_input_shape": [null, 64, 64, 3], "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-25-a670ce6415d7>\u00da\b<lambda>\u001a\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"nb_col": 1, "bias": true, "trainable": true, "activation": "linear", "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "name": "conv0", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 3, "nb_row": 1}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "bias": true, "trainable": true, "activation": "linear", "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "name": "conv1", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 32, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "bias": true, "trainable": true, "activation": "linear", "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "name": "conv2", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 32, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_6"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_6", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "bias": true, "trainable": true, "activation": "linear", "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "name": "conv3", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "bias": true, "trainable": true, "activation": "linear", "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "name": "conv4", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_7"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_7", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "bias": true, "trainable": true, "activation": "linear", "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "name": "conv5", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 128, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "bias": true, "trainable": true, "activation": "linear", "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "name": "conv6", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 128, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_8"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_8", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 512, "input_dim": 2048, "trainable": true, "activation": "linear", "W_constraint": null, "W_regularizer": null, "name": "hidden1", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_9", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 64, "input_dim": 512, "trainable": true, "activation": "linear", "W_constraint": null, "W_regularizer": null, "name": "hidden2", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_10", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 16, "input_dim": 64, "trainable": true, "activation": "linear", "W_constraint": null, "W_regularizer": null, "name": "hidden3", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_10", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_11", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "input_dim": 16, "trainable": true, "activation": "linear", "W_constraint": null, "W_regularizer": null, "name": "output", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "bias": true}}]}