{"keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 1], "arguments": {}, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-21-f8158810139d>\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_row": 1, "activation": "linear", "bias": true, "name": "conv0", "W_regularizer": null, "b_constraint": null, "nb_filter": 3, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 1}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_row": 3, "activation": "linear", "bias": true, "name": "conv1", "W_regularizer": null, "b_constraint": null, "nb_filter": 32, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_row": 3, "activation": "linear", "bias": true, "name": "conv2", "W_regularizer": null, "b_constraint": null, "nb_filter": 32, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_row": 3, "activation": "linear", "bias": true, "name": "conv3", "W_regularizer": null, "b_constraint": null, "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_row": 3, "activation": "linear", "bias": true, "name": "conv4", "W_regularizer": null, "b_constraint": null, "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_row": 3, "activation": "linear", "bias": true, "name": "conv5", "W_regularizer": null, "b_constraint": null, "nb_filter": 128, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_row": 3, "activation": "linear", "bias": true, "name": "conv6", "W_regularizer": null, "b_constraint": null, "nb_filter": 128, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "input_dim": 2048, "activation": "linear", "name": "hidden1", "W_regularizer": null, "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "b_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "input_dim": 512, "activation": "linear", "name": "hidden2", "W_regularizer": null, "b_constraint": null, "output_dim": 64, "activity_regularizer": null, "b_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "input_dim": 64, "activation": "linear", "name": "hidden3", "W_regularizer": null, "b_constraint": null, "output_dim": 16, "activity_regularizer": null, "b_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_10", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_6", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "input_dim": 16, "activation": "linear", "name": "output", "W_regularizer": null, "b_constraint": null, "output_dim": 1, "activity_regularizer": null, "b_regularizer": null, "trainable": true}}], "class_name": "Sequential"}