{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"output_shape_type": "raw", "name": "merge_2", "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 16, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_34", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "bias": true, "b_regularizer": null, "nb_row": 8, "border_mode": "same", "W_constraint": null, "activity_regularizer": null, "subsample": [4, 4], "nb_col": 8}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_44"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 32, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_35", "trainable": true, "nb_col": 5, "bias": true, "b_regularizer": null, "nb_row": 5, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_45"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 64, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_36", "trainable": true, "nb_col": 5, "bias": true, "b_regularizer": null, "nb_row": 5, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_8"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_46"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 1024, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_25", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 512, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_47"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 512, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_26", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 512], "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 1, "activity_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 24, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_37", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "bias": true, "b_regularizer": null, "nb_row": 5, "border_mode": "same", "W_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "nb_col": 5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_48"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 36, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_38", "trainable": true, "nb_col": 5, "bias": true, "b_regularizer": null, "nb_row": 5, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_49"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 48, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_39", "trainable": true, "nb_col": 5, "bias": true, "b_regularizer": null, "nb_row": 5, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_50"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 64, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_40", "trainable": true, "nb_col": 3, "bias": true, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_51"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 64, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_41", "trainable": true, "nb_col": 3, "bias": true, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_9"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_52"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 256, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_27", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 100, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_53"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 100, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_28", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_54"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 50, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_29", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 10, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_55"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 10, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_30", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 10], "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 1, "activity_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 24, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_42", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "bias": true, "b_regularizer": null, "nb_row": 5, "border_mode": "same", "W_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "nb_col": 5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_56"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 36, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_43", "trainable": true, "nb_col": 5, "bias": true, "b_regularizer": null, "nb_row": 5, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_57"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 48, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_44", "trainable": true, "nb_col": 5, "bias": true, "b_regularizer": null, "nb_row": 5, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_58"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 64, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_45", "trainable": true, "nb_col": 3, "bias": true, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_59"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 64, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_46", "trainable": true, "nb_col": 3, "bias": true, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_60"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 64, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_47", "trainable": true, "nb_col": 3, "bias": true, "b_regularizer": null, "nb_row": 3, "border_mode": "same", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_10"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_61"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 64, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_31", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 100, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_62"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 100, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_32", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_63"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 50, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_33", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 10, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_64"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 10, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_34", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 10], "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 1, "activity_regularizer": null}}]}], "output_mask": null, "mode_type": "raw", "output_shape": null, "concat_axis": -1, "output_mask_type": "raw", "dot_axes": -1, "arguments": {}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_65"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_35", "input_dim": 3, "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 1, "activity_regularizer": null}}]}