{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "input_dtype": "float32", "name": "lambda_1", "arguments": {}, "function_type": "lambda", "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003\u00fa+ Normalizes the input between -0.5 and 0.5 g\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001Xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-18-6434f11c76d3>\u00da\tnormalize\u001e\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", null, null], "output_shape": [66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "name": "convolution2d_1", "b_constraint": null, "nb_filter": 24, "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "bias": true, "nb_row": 5, "activation": "linear", "activity_regularizer": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "name": "convolution2d_2", "b_constraint": null, "nb_filter": 36, "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "bias": true, "nb_row": 5, "activation": "linear", "activity_regularizer": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "name": "convolution2d_3", "b_constraint": null, "nb_filter": 48, "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "bias": true, "nb_row": 5, "activation": "linear", "activity_regularizer": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "name": "convolution2d_4", "b_constraint": null, "nb_filter": 64, "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "bias": true, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "name": "convolution2d_5", "b_constraint": null, "nb_filter": 64, "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "bias": true, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "subsample": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 100, "name": "dense_1", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "activation": "linear", "activity_regularizer": null, "input_dim": 1152}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 50, "name": "dense_2", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "activation": "linear", "activity_regularizer": null, "input_dim": 100}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 10, "name": "dense_3", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "activation": "linear", "activity_regularizer": null, "input_dim": 50}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_4"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 1, "name": "output", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "activation": "linear", "activity_regularizer": null, "input_dim": 10}}], "keras_version": "1.2.1"}