{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 64, 64, 1], "arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-18-f8158810139d>\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true, "output_shape": null, "function_type": "lambda", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"nb_row": 1, "border_mode": "valid", "name": "conv0", "trainable": true, "nb_col": 1, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 3, "bias": true, "W_constraint": null, "b_regularizer": null, "init": "he_normal", "subsample": [1, 1], "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "name": "conv1", "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 32, "bias": true, "W_constraint": null, "b_regularizer": null, "init": "he_normal", "subsample": [1, 1], "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "name": "conv2", "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 32, "bias": true, "W_constraint": null, "b_regularizer": null, "init": "he_normal", "subsample": [1, 1], "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "name": "conv3", "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "bias": true, "W_constraint": null, "b_regularizer": null, "init": "he_normal", "subsample": [1, 1], "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "name": "conv4", "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "bias": true, "W_constraint": null, "b_regularizer": null, "init": "he_normal", "subsample": [1, 1], "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "name": "conv5", "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 128, "bias": true, "W_constraint": null, "b_regularizer": null, "init": "he_normal", "subsample": [1, 1], "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "name": "conv6", "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 128, "bias": true, "W_constraint": null, "b_regularizer": null, "init": "he_normal", "subsample": [1, 1], "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "hidden1", "trainable": true, "output_dim": 512, "W_regularizer": null, "bias": true, "input_dim": 2048, "b_regularizer": null, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "hidden2", "trainable": true, "output_dim": 64, "W_regularizer": null, "bias": true, "input_dim": 512, "b_regularizer": null, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "hidden3", "trainable": true, "output_dim": 16, "W_regularizer": null, "bias": true, "input_dim": 64, "b_regularizer": null, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_10", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "output_dim": 1, "W_regularizer": null, "bias": true, "input_dim": 16, "b_regularizer": null, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null}}], "keras_version": "1.2.1"}