{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"trainable": true, "input_dtype": "float32", "arguments": {}, "batch_input_shape": [null, 66, 200, 3], "output_shape": [66, 200, 3], "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001Xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>g\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "activation": "linear", "W_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_1", "dim_ordering": "tf", "bias": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "border_mode": "valid", "subsample": [2, 2], "trainable": true, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "activation": "linear", "W_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_2", "dim_ordering": "tf", "bias": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "border_mode": "valid", "subsample": [2, 2], "trainable": true, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "activation": "linear", "W_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_3", "dim_ordering": "tf", "bias": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "border_mode": "valid", "subsample": [2, 2], "trainable": true, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activation": "linear", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_4", "dim_ordering": "tf", "bias": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activation": "linear", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_5", "dim_ordering": "tf", "bias": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "b_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 100, "W_regularizer": null, "W_constraint": null, "name": "dense_1", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "trainable": true, "input_dim": 1152, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 50, "W_regularizer": null, "W_constraint": null, "name": "dense_2", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "trainable": true, "input_dim": 100, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 10, "W_regularizer": null, "W_constraint": null, "name": "dense_3", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "trainable": true, "input_dim": 50, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_4"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 1, "W_regularizer": null, "W_constraint": null, "name": "output", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "trainable": true, "input_dim": 10, "b_regularizer": null}}]}