{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003\u00fa+ Normalizes the input between -0.5 and 0.5 g\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001Xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-17-17b3df6805d6>\u00da\tnormalize=\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", null, null], "function_type": "lambda", "arguments": {}, "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "trainable": true, "name": "lambda_2", "input_dtype": "float32", "output_shape": [66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 5, "nb_col": 5, "subsample": [2, 2], "name": "convolution2d_6", "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 24, "trainable": true, "W_constraint": null, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 5, "nb_col": 5, "subsample": [2, 2], "name": "convolution2d_7", "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 36, "trainable": true, "W_constraint": null, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_10"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 5, "nb_col": 5, "subsample": [2, 2], "name": "convolution2d_8", "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 48, "trainable": true, "W_constraint": null, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_11"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 3, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_9", "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 64, "trainable": true, "W_constraint": null, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_12"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 3, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_10", "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 64, "trainable": true, "W_constraint": null, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "activation": "linear"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.25}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_13"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "input_dim": 1152, "name": "dense_4", "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "output_dim": 100, "b_constraint": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.25}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_14"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "input_dim": 100, "name": "dense_5", "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "output_dim": 50, "b_constraint": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "p": 0.25}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_15"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "input_dim": 50, "name": "dense_6", "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "output_dim": 10, "b_constraint": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "p": 0.25}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_16"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "input_dim": 10, "name": "output", "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "output_dim": 1, "b_constraint": null, "b_regularizer": null, "activation": "linear"}}], "keras_version": "1.2.1"}