{"keras_version": "1.2.1", "config": [{"config": {"name": "lambda_5", "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 1], "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-23-a77a1c37e978>\u00da\b<lambda>\u0018\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "arguments": {}, "output_shape_type": "raw", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"trainable": true, "name": "cropping2d_4", "cropping": [[10, 5], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"name": "conv0", "bias": true, "nb_filter": 3, "b_constraint": null, "nb_row": 1, "W_regularizer": null, "W_constraint": null, "nb_col": 1, "activity_regularizer": null, "init": "he_normal", "b_regularizer": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_31", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "conv1", "bias": true, "nb_filter": 32, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "nb_col": 3, "activity_regularizer": null, "init": "he_normal", "b_regularizer": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_32", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "conv2", "bias": true, "nb_filter": 32, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "nb_col": 3, "activity_regularizer": null, "init": "he_normal", "b_regularizer": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_33", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "maxpooling2d_10", "border_mode": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_19", "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "conv3", "bias": true, "nb_filter": 64, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "nb_col": 3, "activity_regularizer": null, "init": "he_normal", "b_regularizer": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_34", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "conv4", "bias": true, "nb_filter": 64, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "nb_col": 3, "activity_regularizer": null, "init": "he_normal", "b_regularizer": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_35", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "maxpooling2d_11", "border_mode": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_20", "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "conv5", "bias": true, "nb_filter": 128, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "nb_col": 3, "activity_regularizer": null, "init": "he_normal", "b_regularizer": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_36", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "conv6", "bias": true, "nb_filter": 128, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "nb_col": 3, "activity_regularizer": null, "init": "he_normal", "b_regularizer": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_37", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "maxpooling2d_12", "border_mode": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_21", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_4"}, "class_name": "Flatten"}, {"config": {"input_dim": 1024, "name": "hidden1", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 512, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "he_normal"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_38", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_22", "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": 512, "name": "hidden2", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 64, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "he_normal"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_39", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_23", "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": 64, "name": "hidden3", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 16, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "he_normal"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_40", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_24", "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": 16, "name": "output", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 1, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "he_normal"}, "class_name": "Dense"}], "class_name": "Sequential"}